; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph0 - mode
	thermograph1 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation6 - direction
	Star7 - direction
	GroundStation8 - direction
	Star10 - direction
	GroundStation12 - direction
	GroundStation13 - direction
	Star11 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Star14 - direction
	GroundStation9 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Planet17 - direction
	Phenomenon18 - direction
	Star19 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star14)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 Star11)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
)
(:goal (and
	(pointing satellite0 Planet16)
	(have_image Phenomenon15 thermograph0)
	(have_image Planet16 thermograph0)
	(have_image Planet17 thermograph0)
	(have_image Phenomenon18 thermograph1)
	(have_image Star19 thermograph0)
))

)

; plan
1. (turn_to satellite0 groundstation9 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 groundstation9)
   goals met: 0 of 6
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
3. (calibrate satellite0 instrument1 groundstation9)
   added: (calibrated instrument1)
   goals met: 0 of 6
4. (turn_to satellite0 phenomenon18 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 phenomenon18)
   goals met: 0 of 6
5. (take_image satellite0 phenomenon18 instrument1 thermograph1)
   added: (have_image phenomenon18 thermograph1)
   goals met: 1 of 6
6. (turn_to satellite0 phenomenon15 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon15)
   goals met: 1 of 6
7. (take_image satellite0 phenomenon15 instrument1 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 2 of 6
8. (turn_to satellite0 planet17 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet17)
   goals met: 2 of 6
9. (take_image satellite0 planet17 instrument1 thermograph0)
   added: (have_image planet17 thermograph0)
   goals met: 3 of 6
10. (turn_to satellite0 star19 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 star19)
   goals met: 3 of 6
11. (take_image satellite0 star19 instrument1 thermograph0)
   added: (have_image star19 thermograph0)
   goals met: 4 of 6
12. (turn_to satellite0 planet16 star19)
   deleted: (pointing satellite0 star19)
   added: (pointing satellite0 planet16)
   goals met: 5 of 6
13. (take_image satellite0 planet16 instrument1 thermograph0)
   added: (have_image planet16 thermograph0)
   goals met: 6 of 6
